hacUPB/micro-2420-eval-u3-JeronimoQ107/twrke18fProject3_ftm_simple_pwm/board/pin_mux.h
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/*! @name PORTC12 (number 50), PTC12
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_PTC12_GPIO GPIOC                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_PTC12_GPIO_PIN_MASK (1U << 12U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_PTC12_PORT PORTC                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_PTC12_PIN 12U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_PTC12_PIN_MASK (1U << 12U)      /*!<@brief PORT pin mask */
                                                       /* @} */

/*! @name PORTC13 (number 49), PTC13
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_PTC13_GPIO GPIOC                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_PTC13_GPIO_PIN_MASK (1U << 13U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_PTC13_PORT PORTC                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_PTC13_PIN 13U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_PTC13_PIN_MASK (1U << 13U)      /*!<@brief PORT pin mask */
                                                       /* @} */

/*! @name PORTC14 (number 46), PTC14
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_PTC14_GPIO GPIOC                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_PTC14_GPIO_PIN_MASK (1U << 14U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_PTC14_PORT PORTC                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_PTC14_PIN 14U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_PTC14_PIN_MASK (1U << 14U)      /*!<@brief PORT pin mask */
                                                       /* @} */

/*! @name PORTC15 (number 45), PTC15
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_PTC15_GPIO GPIOC                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_PTC15_GPIO_PIN_MASK (1U << 15U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_PTC15_PORT PORTC                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_PTC15_PIN 15U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_PTC15_PIN_MASK (1U << 15U)      /*!<@brief PORT pin mask */
                                                       /* @} */

/*! @name PORTD13 (number 25), PTD13
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_PTD13_GPIO GPIOD                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_PTD13_GPIO_PIN_MASK (1U << 13U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_PTD13_PORT PORTD                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_PTD13_PIN 13U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_PTD13_PIN_MASK (1U << 13U)      /*!<@brief PORT pin mask */
                                                       /* @} */

/*! @name PORTD14 (number 24), PTD14
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_PTD14_GPIO GPIOD                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_PTD14_GPIO_PIN_MASK (1U << 14U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_PTD14_PORT PORTD                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_PTD14_PIN 14U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_PTD14_PIN_MASK (1U << 14U)      /*!<@brief PORT pin mask */
                                                       /* @} */

/*! @name PORTD15 (number 22), PTD15
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_PTD15_GPIO GPIOD                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_PTD15_GPIO_PIN_MASK (1U << 15U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_PTD15_PORT PORTD                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_PTD15_PIN 15U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_PTD15_PIN_MASK (1U << 15U)      /*!<@brief PORT pin mask */
                                                       /* @} */

/*! @name PORTD16 (number 21), PTD16
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_PTD16_GPIO GPIOD                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_PTD16_GPIO_PIN_MASK (1U << 16U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_PTD16_PORT PORTD                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_PTD16_PIN 16U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_PTD16_PIN_MASK (1U << 16U)      /*!<@brief PORT pin mask */
                                                       /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
